---
kind: type
id: T:Autodesk.Revit.DB.Lighting.LineLightShape
source: html/3fce7f00-ae7a-04db-a6e8-dab9794bd6a7.htm
---
# Autodesk.Revit.DB.Lighting.LineLightShape

This class encapsulates a line light shape.

## Syntax (C#)
```csharp
public class LineLightShape : LightShape
```